import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-expirience',
  template: `<div>
  <h1>My Expirience</h1>

  <ul>
    <li *ngFor="let item of myExpirience">
      {{item}}
    </li>
  </ul>
  </div>`,
  styleUrls: ['./expirience.component.css']
})
export class ExpirienceComponent implements OnInit {

  myExpirience:string[] = [`Задача организации, в особенности же сложившаяся структура организации влечет за собой процесс внедрения и модернизации направлений прогрессивного
  развития. Товарищи! укрепление и развитие структуры позволяет оценить значение новых предложений.`,
  ` Значимость этих проблем настолько очевидна, что сложившаяся структура организации позволяет выполнять важные задания по разработке направлений прогрессивного развития.`,
  `Разнообразный и богатый опыт постоянный количественный рости сфера нашей активности требуют от нас анализа модели развития. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять
    важные задания по разработке существенных финансовых и административных условий. Повседневная практика показывает, что консультация с широким активом способствует
     подготовки и реализации форм развития.`];
  constructor() { }

  ngOnInit(): void {
  }

}
